БухЭксп/Catalogs/CW_МониторинговыеПараметрыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МониторинговыеПараметрыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Коносаменты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сворачивать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МониторинговыеПараметрыОбъектов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() 
		или Родитель <> Ссылка.Родитель Тогда
		
		ИндексЭлемента = ПолучитьИндексЭлемента();                                    
		
		Если НЕ ЭтоГруппа Тогда
			Если ТипЗнч(Значение) = Тип("Неопределено") Тогда
				Значение = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
			КонецЕсли;  
			
			Если Параметр.ЭтоКонтрольнаяДата Тогда
				Если ТипЗнч(ЗначениеПлан) = Тип("Неопределено") Тогда
					ЗначениеПлан = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;
				Если ТипЗнч(ЗначениеФакт) = Тип("Неопределено") Тогда
					ЗначениеФакт = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;  
			КонецЕсли;
			
		КонецЕсли;   
	КонецЕсли; 
	
	Если НЕ ЭтоГруппа 
		и Параметр.ЭтоКонтрольнаяДата Тогда  
		Значение = Макс(ЗначениеПлан, ЗначениеФакт);  
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование"));
	КонецЕсли;   
	
КонецПроцедуры

Функция ПолучитьИндексЭлемента()   
	
	ИндексЭлемента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_МониторинговыеПараметрыОбъектов.ИндексЭлемента КАК ИндексЭлемента
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Владелец = &Владелец
	|	И CW_МониторинговыеПараметрыОбъектов.Родитель = &Родитель
	|	И CW_МониторинговыеПараметрыОбъектов.ЭтоГруппа = &ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексЭлемента УБЫВ";  
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);  
	Запрос.УстановитьПараметр("Родитель", 	Родитель);
	Запрос.УстановитьПараметр("ЭтоГруппа", 	ЭтоГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		ИндексЭлемента =  Выборка.ИндексЭлемента;
	КонецЕсли;
	
	Возврат ИндексЭлемента + 1;
	
КонецФункции
